public class HW1 {
    public static void main(String[] args) {
        /*1) (Преобразовать градусы Цельсия в градусы Фаренгейта) Напишите программу, которая считывает градусы Цельсия из консоли, затем преобразует его в градусы Фаренгейта и отображает
        результат. Формула преобразования выглядит следующим образом:
        Фаренгейты = (9/5) * Цельсий + 32
        Подсказка: в Java 9/5 равно 1, а 9.0/5 равно 1,8.*/

        /*2) (Вычислите объем цилиндра) Напишите программу, которая читает по радиусу и длину цилиндра и вычисляет площадь и объем, используя следующую формулу:
        площадь = радиус * радиус * p
        объем = площадь * длина

        3) (Сумма цифр целого числа) Напишите программу, которая считывает целое число от 0 до 1000 и складывает все цифры целого числа. Например, если целое число равно 932,
                сумма всех его цифр равна 14.

        4) (Найти будущие даты) Напишите программу, которая предлагает пользователю ввести целое число для
        сегодняшний день недели (воскресенье — 0, понедельник — 1, … и суббота — 6). Также предложить пользователю ввести количество дней после сегодняшнего дня для будущего дня и отобразить будущий день недели.

        5) Напишите программу, которая предлагает пользователю ввести три целых числа и отображать целые числа в неубывающем порядке

        6) Напишите программу, которая читает неопределенное количество целых чисел, определяет, сколько положительных и отрицательных значений были прочитаны, и вычислите общее и среднее значение чисел и выведите на экран
        Ваша программа заканчивается вводом 0.

        7) Предположим, что плата за обучение в университете в этом году составляет 10 000 долларов и увеличивается на 5% каждый год. За год стоимость обучения
        составит 10 500 долларов. Напишите программу, которая вычисляет стоимость обучения за десять лет и определите общую стоимость четырехлетнего обучения после десятого года

        8) Напишите программу, которая предлагает пользователю ввести количество учеников, имя и оценку каждого ученика и отображает имя ученика с наивысшим баллом

        9) Напишите программу, которая читает целые числа, находит наибольшее из них и подсчитывает их вхождения. Предположим, что ввод заканчивается числом 0.
        Предположим, вы ввели 3 5 2 5 5 5 0; программа находит, что наибольшее значение равно 5, а количество вхождений для 5 равно 4.

        10) (Найдите наименьшее n такое, что n^2 > 12 000) Используйте цикл while, чтобы найти наименьшее целое число n такое, что n2 больше 12 000.*/
    }
}
